[
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_1.mp4",
        "Captions": "There are three men in a miserable place where there’s blood on the floor, it seems to be a questioning room. One is tied up, and it looks like he has been tortured badly, and others apparently are cops, and they’re arguing about him. The supervisor is asking his assistant to get the poor guy down, telling him this is against human rights. The assistant seems unhappy, which angers the boss. He gets close to hitting him before explaining that the suspect received 10 million rupees, meaning he must know more than he should, especially given his poor background. The tortured man, bleeding and desperate, insists he knew the answers. As he finishes speaking, exciting music plays, leading to a flashback of kids playing cricket. A title reads 'The Poor Millionaire', and the children shout, “Jamal, catch it!” While chasing the ball, Jamal is nearly hit by a plane and falls. His teammates get mad, and the police arrive to remove them since they were playing on the runway, forcing the kids to flee."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_2.mp4",
        "Captions": "At the beginning, there is a scene of a guy being tortured by someone, most likely a policeman. After that, another scene comes up of a TV show named “who wants to be a millionaire” where the host continuously makes questions for the guest to answer. He asked him about the name of the company he works for and the position he occupies. While the show continues, the audience expresses that they’re enjoying the show by laughing. So, the host continues questioning the other guy about his duty and wondering about his missions as a phone assistant. With shamefaced the guest says that all he does is get tea to people, before he even finishes his answer, both the host and audience have reacted mockingly to him. The guest was shocked by that action from the host, especially this later was somehow trying to make fun of him. While that, the participant was diving in his imagination thinking about a pretty smiling girl wearing a yellow dress, standing next to the train, looking at him, she is probably his girlfriend. After that, a new scene comes to the vision, where the police officer enters the room and aggressively asks his assistant if the suspect has confessed or not. The answer was no, claiming that he barely said his name and nothing more. The officer was angry that his assistant couldn’t get any further information from the suspect, so he suggested that using electricity would make him confess. The assistant went to get the battery in order to shock the suspect, while this later is breathing heavily, the officer is throwing him with questions about if he was connected to someone by either a cell phone or pager machine."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_3.mp4",
        "Captions": "In this video clip, the officer enters the questioning room and asks his assistant if the suspect has confessed or not. Regretfully, the assistant tells his boss that the suspect wouldn’t say anything except his name. The officer went mad about that, and he thought maybe some extra pain would make him talk. So, he suggests shocking him with electricity. While the assistant was preparing for that, the officer started throwing the suspect with questions about if he was connected to someone with either a cell phone or a pager machine or maybe an electronic ship under the skin. Once he said that, the assistant tried to look for it before he got interrupted. Two seconds later, the officer continues provoking the suspect and asks him to cooperate and tell him how he cheated. The suspect seems to be confused with no word coming from his mouth. The officer left with no response, and the assistant started shocking the suspect with electricity. You can hear the suspect voice from the pain. Once the assistant had finished, the officer came back to talk to the poor guy, but suddenly he was unconscious, so he started yelling at his assistant because he over tortured him."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_4.mp4",
        "Captions": "This video portrays a group of kids having fun and playing peacefully in an abandoned warehouse. They look dirty and poor. A man in a van, accompanied by a kid, tells him, 'It’s time for work.' The kid gets out of the van and starts yelling at the other kids, who seem afraid of him. He says, 'Do you think you’re here on a holiday?' Then, he takes a baby from a little girl and gives it to another girl, telling her, 'ake it, it’s yours today. Babies get more.' It looks to me like these kids are either orphans or kidnapped, and they are being used by that man to make money, as he employs them as beggars."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_5.mp4",
        "Captions": "In this video, a man gives a soda drink to two kids inside what looks like a makeshift tent, saying, “It’s hot today.” The kids seem happy with the drink, but they also appear to be hostages of that man.  A group of kids in a van are taken to a forest area with children’s games. They seem happy at first, and the place resembles a camping trip. However, the kids’ faces and clothes suggest they’ve been kidnapped for a reason. While eating, one child remarks, “He looks like a priest. He’s a good man taking care of us.” Another boy replies, “But he doesn’t let us speak to the other kids.” Without a doubt, these kids are victims of human trafficking. "
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_6.mp4",
        "Captions": "There is a Man standing still with his hands being crossed, staring at something or someone. After that, several children of whom are  sitting and some of them standing are staring at a group of children lined up facing the man while he is walking right and left with his hands in his pockets, then he calls the name of a boy who then takes a step forward and starts chanting. He goes back in line with the other boys and the man starts touching the boy's head gently showing some sort of support, then calls another boy who also takes a step forward to start chanting loudly like the other boy. A girl next to him in the line-up starts laughing, while the man shows some annoyed facial gestures. As a consequence, The same boy who starts singing last starts violently hitting the girl beside him and loudly cries 'Do not make fun of me'. Another man grabs the child from his arms and throws him off on the ground, then the boy comes back to the man and starts hitting him in his stomach area while the other man is sitting on a chair watching along with the other children this whole scene happening in front of their eyes. At the end, the boy happens to be with a man in some sort of vehicle, staring at something from the interior window."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_7.mp4",
        "Captions": "There is a Man talking to some people and using body language. He appears to be a tourist guide talking to some tourists. Suddenly, Two boys appear barefoot staring at something while there are people in the background walking towards the building and some of them gathered talking. The boys head towards the entrance to the historical building and start staring at things in awe. Then a sign containing text appears, twisting because of the wind. Next, the boys start wearing some shoes that are on the ground while staring at each other and smiling and looking happy. One of the boys starts gazing in the sky looking at something, when all of a sudden he is approached by a woman and a man who start asking him of the destination of a particular area. He then looks at a sign beside him to check. "
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_8.mp4",
        "Captions": "In the first scene, the audience were clapping and shouting. At the same time, the competitor seems to be surprised about what is happening. In the second scene, the competitor finds himself at the officer desk, and this later questions him about an anonymous girl wondering about her situation now. While they’re talking, a new scene shows up where there is a noisy old train moving, with a bunch of kids and men sitting on top of it. The kid tells his friend to try to forget about what’s happened in the past. Then he asks him to go with him. After that, it appears that they have started a small business, selling different products like balloons, fruits to people on the train."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_9.mp4",
        "Captions": "The train is moving, and the music is turning, and the kids look like they’re having a good time together. They’re selling food and other products to passengers. They spend all their day inside the train, apparently, they have no other place to go or live in. That train for them is everything. Suddenly the train controller kicked them out, but they didn’t hesitate to sneak one more time to the train. Because of hunger, sometimes they steal some of the passenger’s food to eat. One day, they were caught and while they were trying to get away with it, suddenly, they fell from the train."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_10.mp4",
        "Captions": "In this video, a kid hangs from the train’s ceiling toward the window by a rope held by another kid. The kid tries to steal food but gets caught. The kid on the ceiling can’t hold on, and they fall off the train. Nearby, a grand castle appears from a distance. One kid asks his friend, “Is this heaven?” The other kid replies, “You haven’t died, Jamal!” Jamal then asks, “What is it? A hotel?”  The place is the Taj Mahal, one of the most beautiful mosques in India. The kids in this video look poor, and they’re willing to do anything to feed their hunger."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_11.mp4",
        "Captions": "In this video, two kids (a boy and a girl) are sleeping when a boy enters and demands the kid, “Come here!” The kid responds, “No, brother, you’re drunk!” The boy replies, “I’m the boss. Do what I say. Now get out!” He then tells the girl, “I saved your life, didn’t I?” She pleads, “Salim, no! Please!” The kid attacks Salim and starts beating him. Eventually, Salim grabs the boy and locks him in a room. It’s clear that Salim was trying to rape the girl, who appears terrified of him. The kid is her brother, desperately trying to save her."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_12.mp4",
        "Captions": "In this video, a boy walks through the streets of India. Suddenly, he stops and buys a ticket. He enters a place where some men are gambling and asks for someone called Gavid. They don’t pay him any attention until he pulls out a gun and says, “I killed Maman, and I’ll kill you too!” Suddenly, a man in the back asks, “Did you kill him for sure?” The boy assures him, and the man replies, “Good. Come here, my friend. I’ve been looking for someone like you.” It appears to me this man is seeking an assassin to eliminate his enemies. "
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_13.mp4",
        "Captions": "The boys are in a house, one of them is pouring some sort of liquid from two bottles using both his hands, while the other is taking something out from a closet. The boy finds something and shakes it out and heads towards a room that seems to be a bathroom because there is the sound of water you hear when someone takes a shower. Actually, there is a girl who is taking a shower while the other boy in the house is still drinking from the bottle. The girl comes out of the bathroom and the boy hands her the piece of cloth, and she goes back inside the bathroom and shuts the door. The other boy who is drinking the bottle leaves the house while this is happening. At the end, there are crossroads full of cars and motorcycles going in different directions, and there are sounds of honking."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_14.mp4",
        "Captions": "There is a woman who is driving a car at a relatively high speed when she suddenly comes across a heavy traffic and starts honking at other cars to move showing frustration, while another boy is in another car being driven somewhere and comes across people shouting and waving to him and some taking photographs of him because he is seemingly a famous person. Then a woman approaches the boy in the car and seems to recognize him because she calls his name. At the same time, while the woman is trying to talk to him, other people who also seem to recognize him approach him and start calling out his name while he is silent just looking at them from the interior from the car windows. There are people lined up trying to enter a place which looks like a studio for a show, while some people inside the studio are setting it up for the show to commence. The other woman is still stuck in traffic and honking as usual while showing frustration."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_15.mp4",
        "Captions": "There is a woman inside her car, and it seems to be in a hurry. On the other side, there are a group of people at different places gathering together to watch their favorite show “Who Wants to Be a Millionaire”. The young lady that was waiting inside her car while a car traffic has decided to leave her car in order to catch the show. The show starts, and the host introduces the participant and the prize would get if he answers the last question. The host asked him if he’s ready and the answer was yes, meanwhile, one of the audience shouted his name which is “Jamal”."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_16.mp4",
        "Captions": "The show starts, the host checks if the participant is ready for the last question, the answer is yes. Most of the Indian community are gathering together to watch and support Jamal to win the prize. A young lady gets close to the crowd watching the show. The host asks the participant if he is a big reader, and in return the participant confirms that. The host reveals the last question and the given choices. The participant starts smiling like he wasn’t expecting that question ever. His memory brings him back to his childhood with his friend, when they were discussing the same topic. So, he continues smiling, wondering if it is destiny who put him in that position and that question. The host was confused, so he asked him if he already knew the answer, but the response was no. The host reminds him that if his answer was wrong, he would lose everything, so either he gives up and takes 10 million or gives a wrong answer and loses. Even though the participant insisted on playing, He decided to call his brother to help him pick the right answer, but no pick up in return."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_17.mp4",
        "Captions": "The video begins with a man and a woman in what appears to be an intelligence center. The man says, “If he’s not the source, he must be looking for the source,” implying they’re discussing a spy. A man walks down the street, visibly anxious, glancing around to see if he’s being followed. He enters a building, opens a door, and steps inside, checking for surveillance cameras filming him. He then opens a safe and disables the security system while nervously scanning the room.   Finally, he finds a photo of two men in suits, with the CIA flag behind them. A flashback shows one of the men saying, “Your mission will save American lives.” The other adds, “I want you in this program.” Overwhelmed by the memory, he collapses. It becomes clear that this man is a CIA agent seeking revenge against the men in the photo, believing they lied to and exploited him."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_18.mp4",
        "Captions": "In this video, two armed men check a house while a group of people carefully monitor them from an agency—likely an intelligence agency overseeing a mission. Suddenly, they start shooting at a door, assuming someone is hiding behind it. They move closer, open the door, and a man appears, beating one of them in the head with a chair. The agency loses the signal, and the director requests a support team.  The man overpowers the agents, but soon realizes the support team has arrived. He grabs a gun and moves further into the building. He opens another door and finds a woman. He asks her, “What are you doing here?” She replies, “I was detained here after arriving from Berlin.” The man seems to recognize her and demands, “Where is Daniel?” She stays silent. Suddenly, a phone rings.  It appears to me that this man is a former CIA agent who is either out of control or possesses top-secret information, prompting the CIA to pursue him."
    },
    {
        "video_category": "DC",
        "sub_category": "Complex_sound_and_motion",
        "video_name": "CSM_v_19.mp4",
        "Captions": "There is a man in a police car being chased down by another man in his normal car in the middle of the city. The man in the police car gets into a car accident with another car but keeps driving anyway and starts shooting at the other man from his window. The other man attempts to shoot the man in the police car too and aims the weapon towards him, but doesn’t. The man in the normal car then hits the man in the police car from the back and damages the whole back part of the vehicle. But, the man in the police car keeps driving anyway, running away from the man in the normal car. The chase down persists, and they start bumping into each other on the same road lane until they finally crash."
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_1.mp4",
        "Captions": "In this scene from Memento, Leonard, also known as Lenny, is speaking with Teddy in a car. Lenny has short-term memory loss due to an injury and relies on Polaroids and notes tattooed on his body to help him remember important information. Teddy is trying to convince Lenny that Natalie, a woman Lenny has a photo of, is involved with drugs. He claims that Natalie's boyfriend is a drug dealer and that Natalie is involved in his operation, slipping him answers to questions related to his dealings on the backs of drink coasters at her bar. Lenny is skeptical, not knowing why Teddy would want him to know this information, especially since Teddy knows his condition. Teddy warns Lenny not to go back to Natalie’s, saying that she will start to figure out he doesn’t really know why he’s there and turn the situation to her advantage. He also warns Lenny that he can’t go back because she already knows who he is, but that she doesn’t know who Teddy is. Lenny questions Teddy’s motives, asking why he’s following him and worried Natalie will use Teddy against him. Teddy reassures Lenny that he doesn't need to worry because she doesn’t know who Teddy is, and implies he has ulterior motives by stating that somebody always has to pay, and maybe this time it will be Lenny."
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_2.mp4",
        "Captions": "This scene from Memento picks up immediately following the previous one. After Teddy warns him about Natalie, Lenny drives to Ferdy’s Bar, a location Teddy gave him as a warning about Natalie’s drug involvement. Lenny reviews a drink coaster from Ferdy’s bar, with the address of the bar on one side and a note from “Natalie” on the other. As he enters the bar, Natalie immediately questions why he is there, commenting on his attire. Lenny asks for a beer, but does not remember why he is there. Natalie recognizes him as the “memory guy” and questions him further. Lenny confirms his memory loss. Natalie says that her boyfriend, Jimmy, told her about him and that Lenny was staying at the Discount Inn. Natalie reveals that a cop stopped by the bar looking for a man who can’t remember anything, implying Lenny may be in trouble. Lenny mentions that chronic alcoholism is a cause for memory loss, and Natalie asks him if his name is Teddy, to which he says “no” and gives his real name, Leonard. She then asks if Teddy sent him, and Lenny again says he doesn't know. Natalie asks what happened to Jimmy, and Lenny once again doesn't have any answers for her."
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_3.mp4",
        "Captions": "This scene from the movie The Nines opens with a closeup shot of Gary, a man in a plaid shirt with spiked blonde hair, looking pensive in a dimly lit room. His eyes dart around as though he is searching for something. The shot then cuts to a telephone with several keypad buttons sitting on a bed. Gary is still thinking in the background, and there is a sound of a phone ringing, followed by a knock at the door. The scene changes from black and white to color. Gary is now wearing a light-colored suit and is at a bar, drinking from a metal mug. He is handed the mug by a bartender. A woman is speaking to him about a “condition,” which is not identified. Gary says nobody’s perfect and tells the woman that the last thing he remembers is his wife. The scene cuts back to the black-and-white hotel room. Gary picks up a piece of paper that has been slid underneath his door. It reads “TAKE My Call” in English and “أحب إنيتك” in Arabic. Then the scene cuts back to the bar. Gary is speaking to the woman again and says his wife is dying. The woman seems shocked, and asks him to clarify. Gary looks down at his mug and sets it down, before responding that he “remembers” his wife dying. The scene cuts back to the black-and-white hotel room again. Gary answers the phone and places the Polaroid photo of the shirtless, smiling man underneath the phone, as if to show the person on the other line. The person asks Gary why he called and what he wants. Gary responds that he knows it was the person calling who sent the note under the door and asks her again, what she wants? Gary then says he doesn’t know what he wants. “Something bad, maybe,” he says. He cries and says he doesn’t know what he has done, and no one would believe him because of his “condition.” “Nobody believes Sammy. I didn’t even believe Sammy,” he says to the person on the phone, then he abruptly hangs up the phone."
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_4.mp4",
        "Captions": "This scene from The Nines opens in black-and-white, showing Gary, wearing a dark jacket and a plaid shirt, getting out of his black Ford pickup truck and telling an older man in a suit to make him a bag. Gary gets back into the truck and drives to an industrial building with several silos. After driving around the silos, Gary pulls up to a ramshackle building with a metal roof and several boarded-up windows. He exits the truck, holding a handgun. He walks into a dark hallway with tiled walls and a concrete floor. The end of the hallway has a white tarp in the doorway. He opens the door and the scene changes to color. A woman, who Gary identified as his wife earlier in the movie, is sitting at a table, staring out a window. The scene cuts back to the black-and-white industrial setting, where Gary and his black car are now parked across from his pickup truck. He is confronted by a man with a mustache, exiting the passenger side of the pickup. The man, wearing a suit, calls Gary “Jimmy.” He identifies himself as Jimmy and then he questions the mustached man on being there, and says he knows the man remembered him.  The mustached man says he remembers Gary. Gary asks where Teddy is, and the mustached man tells Gary to strip. Gary pushes the man to the floor and orders him to take his clothes off. Gary pulls out his gun and demands the man take off his clothes again.  The mustached man removes his suit jacket, and Gary says that the man is making a mistake. After the man removes his shirt and asks if he told Gary why he’s there, Gary tells the man he doesn’t care what Teddy told him, then orders him to take off his pants.  The man tells Gary he has $200,000 hidden in his car. He tells Gary to take the money, and then he will walk away. Gary angrily asks if he thinks he can bargain with him, before repeating his demand that the man remove his pants. The man asks what Gary wants, and Gary says he wants his fucking life back. Gary strangles the man to death. The scene changes to color again, to the sunlit room where the woman was sitting. She asks him if there’s any point in asking. The scene then cuts back to the black-and-white setting, where Gary is standing over the man’s dead body. He is naked from the waist down. "
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_5.mp4",
        "Captions": "This video, with a dark theme, portrays a man looking at another man as if he realizes that he knows him. He then calls him 'Officer Gamel'. The man pauses for a second and turns around to see if the man sitting back and reading a journal was watching. Then, he asks him to follow him out. Gamel carelessly throws the coffee cup on the ground. After that, the man takes a photo of him with a car. The officer looks nervous when asked by the cameraman to smile; instead, he changes his spot and fakes a smile. Then, he tells the cameraman, who is trying to write 'Gamel' on the picture, to write 'Teddy' instead because he works under a fake name. After he gives the man a paper with directions to a location and his phone number, the cameraman asks him if he would go with him, and he says no. Then, he comments on his picture, “Nice pic, I look thin”. The man looks like he’s trying to spy on someone or to finish him off."
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_6.mp4",
        "Captions": "In this scene, a man discovers money in a suit pocket and drags a body to the underground floor while whispering, 'Samy'. He angrily questions how someone knows about 'Samy'. Hearing a car outside, he rushes out and identifies the man in the car, Teddy, using photos with names. The man asks Teddy, who claims to be a cop, for help transporting an injured man. However, he suddenly attacks Teddy, who calls him 'Lenny' and admits he's helping him find someone. The man, revealed to be Leonard (Lenny), is seeking revenge for his wife. He confronts Teddy about the injured man downstairs, accusing him of knowing about 'Samy'. Teddy explains the man raped Leonard's wife and ruined his mind, urging him to check his tattoos for confirmation. Leonard questions the $200,000 the man had, and Teddy nervously claims it was related to drugs, identifying the man as Jimmy, the target of Leonard's revenge. Leonard, suffering from schizophrenia, grows increasingly suspicious of Teddy, accusing him of manipulation. Teddy insists Leonard already took half the money, but Leonard doubts his honesty, fixating on why anyone would know about 'Samy'. The scene highlights Leonard's fractured personality, his uncertainty, and his struggle to discern reality from his delusions."
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_7.mp4",
        "Captions": "A man suffering from schizophrenia and severe memory problems confronts another man, who challenges his perception of reality by revealing unsettling truths about his wife and past. The man is told that his wife survived an assault but later suffered due to his condition, and he begins to recall fragmented memories involving insulin and her death. As the two discuss the events, the man struggles to accept the truth, instead clinging to a constructed narrative about another person, Samy, to avoid guilt. The other man urges him to take revenge, suggesting it doesn’t matter whether his target, Jimmy, was truly responsible. In the end, it becomes clear that the man has already killed Jimmy and is trapped in a cycle of delusion, unable to fully recall or accept his past actions."
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_8.mp4",
        "Captions": "This scene from The Nines begins with a mustached man wearing glasses talking to Gary, who is dressed in a light suit jacket. They are standing in an industrial setting near some stacked wooden crates. The mustached man tells Gary he was the cop assigned to Gary's wife's case. He says he believed Gary and thought he deserved a chance for revenge. The mustached man helped Gary find the other guy in his bathroom that night. The mustached man explains that he helped Gary find the other guy and gives him two polaroid photographs, one of him, and one of Gary shirtless. Gary asks him who the guy was. The mustached man tells Gary that it was just some guy, and it doesn’t matter who, adding that it was bad luck. Gary explains that he was so sure Gary would remember the event when he killed him, but it didn’t stick. He adds that for Gary, nothing ever sticks. The man shows Gary the polaroid photo of him shirtless and says that he took that picture right after he did it. Gary thanks the man sarcastically. The man says that Gary gave him a reason to live, so he was happy to help. Gary responds that he doesn’t want the truth, he makes his own truth, as his police file demonstrates. The man asks Gary who took out the twelve pages of his wife’s case file. Gary claims he did not do it. The man tells Gary that he did, because he wanted to create a puzzle Gary could never solve. Gary angrily asks how many people he had to go to, or how many John Gs or James Gs he had to go to, calling the man Teddy. The man tells Gary that his mother calls him Teddy, but his real name is John Edward Gammell. He tells Gary to cheer up because there are plenty more John Gs for them to find. "
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_9.mp4",
        "Captions": "This scene from Interstellar opens on a man and a girl standing on a grassy hillside above a lake. In the background, there’s a line of wind turbines. The man, who is wearing a brown jacket and jeans, says that she did nicely. They laugh, and then walk down to the bottom of the hill where a small black jet lies on the ground. The man asks how long it’s been there. The girl tells him the Delhi Mission Control went down ten years ago. The man walks around the aircraft. He is holding a small laptop and places his hand on the side of the aircraft, and feels the surface. A young boy with dark hair joins the group. The man explains that he’s not sure how it came down so low and suggests that maybe the sun cooked its brain or it was looking for something. The girl, who appears to be very young, asks the man what he’s going to do with it. The man picks up a chainsaw and says he is going to give it something socially responsible to do. He lifts the chainsaw and the girl asks if they can just leave it because it isn’t hurting anyone. The man tells her that her son needs to learn to adapt. He places the small jet into the truck bed, which has a metal rack. The group enters the truck and drives away from the lake. The group pulls up to a building with a yellow school bus parked outside and the American flag flying. The man hands the girl a notebook and pencil and tells her that he has class. The scene shifts inside the building, to a small office where a man in a suit is sitting at a desk while a woman stands nearby. The first man and the girl enter the office and are greeted. The man is informed that they are late. He explains that they had a flat tire and adds that they had to stop off at the “Asian fighter plane store.” He points to the small jet in the truck bed. He tells the office workers that the small aircraft is a surveillance drone with outstanding solar cells. The man and girl sit down at the desk. They are handed some papers that appear to be Tom’s scores. The man in the suit explains that Tom is going to make an excellent farmer, and the woman agrees. The first man asks about college. The man in the suit explains that the university only accepts a handful of students, and that they don't have the resources. The man asks what the money goes toward if not to help the students. The man in the suit says that it doesn’t go to the university; Coop needs to be realistic. The man tells him that he pays his taxes. "
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_10.mp4",
        "Captions": "This scene from Interstellar shows Cooper, Murph, and Tom driving along rows of corn in their truck. Cooper tells Tom to go faster, and is shown tightening the buckle on his seatbelt as the truck speeds up.  Cooper asks Tom how long it’s been up there. Murph says, “The Delhi mission control went down the same as ours…ten years ago.” Tom asks how it could be there that long. Coop says he doesn't know and suggests that the sun may have cooked its brain, or it was looking for something. He opens a part of the plane with a wrench and places a small laptop computer into the opening.  Murph asks what he plans to do with the aircraft now. He says he’s going to give it a socially responsible thing to do before climbing onto the plane’s wing, and Murph steps on the wing behind him. Tom approaches the wing and hands Coop a toolbox. Murph asks her father what he plans to do with it, and he says that it's going to help drive a combine. Murph asks if they can just leave it there because it's not hurting anybody. Cooper tells his daughter that Tom needs to learn how to adapt, just like the rest of them. He starts the truck, and they drive away with the drone strapped to the roof. Inside the truck, Murph asks him what it is they do and if it will make her mad. Cooper tells her to relax, and she asks him to try not to make her angry. Cooper pulls up to a small brick building where a school bus is parked out front and there’s a flag pole with the American flag on it. He tells Tom that this one needs to wait. Inside the building, Cooper enters an office. A Black man in a suit and a blonde woman are working inside. The man greets Cooper and tells him that they are late. Cooper explains that they had a flat tire, and jokes that they had to stop at the Asian fighter plane store. The man and woman tell Cooper that Tom got his scores back, and he will make an excellent farmer. Cooper asks them about college, and the man says that the university only accepts a handful of students because they don’t have the resources. Cooper asks him where the money goes if it's not for the university. The man explains that he's going to have to come to terms with the fact that not everyone goes to the university. Cooper, Tom, and Murph are again on the hillside next to their truck. Cooper is controlling the drone via laptop, while Murph and Tom watch it fly over the water. They all laugh as Cooper pilots the drone."
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_11.mp4",
        "Captions": "In this scene from Interstellar, Cooper and Murph are being shown around a secret NASA base by Professor Brand. Cooper was once a pilot for NASA before it was shut down when the government deemed it too costly to maintain, considering the dire need to feed the Earth's starving population. However, after several years of crop blights, NASA has resurfaced in secret to find a way to ensure the survival of the human race. Brand tells Cooper that the blight now primarily affects corn, which is the only remaining food source, after other crops like okra, potatoes, and wheat failed in earlier years. Not only is food scarce, but the blight is consuming oxygen, and eventually Earth's atmosphere will no longer be breathable. He explains that Cooper's daughter, Murph, along with others of her generation, will be the last to survive on Earth, if a solution is not found. The conversation becomes somber as Cooper considers what this dire situation means for his family. The scene ends with Amelia leading Murph to Brand's office so that she can take a nap, while Brand and Cooper continue their discussion."
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_12.mp4",
        "Captions": "This scene from Interstellar takes place on a spaceship. Cooper, sitting in a pilot seat in a burgundy t-shirt, discusses possible landing sites with his crew members. Romilly, a bald Black man in a beige shirt, is holding papers and looking at them with a furrowed brow. Doyle, a man with dark hair and a beard, sits across from Brand, a woman with short dark hair wearing a blue sweater. Cooper suggests going to Edmund’s planet because it is further away, but a crewmate tells him that although Miller hasn’t sent much, what she has sent is promising. He says there’s water and organic material on Miller’s planet, adding that you don’t find this every day. Cooper tells them that they don’t think about the resources, including time, that would be spent trying to get back. Cooper gets out of his chair and draws a diagram on a small whiteboard attached to the wall. He draws a circle for Gargantua, and a smaller circle for Miller’s planet. He says that instead of taking the Endurance into orbit around Miller’s planet, they should take a wider orbit around Gargantua, at a parallel with Miller’s planet to avoid a time shift. Then, they can take the Ranger down to Miller’s planet, collect her samples, return to the spaceship, analyze the samples, debrief, and leave quickly, so they lose fuel but save a lot of time. Brand tells Cooper this is good.  Romilly, getting out of his chair, suggests that if they are talking about a couple of years, then he can use the time to research the gravitational observations from the wormhole, which he explains would be a goldmine to Professor Brand. Brand tells Cooper to factor the orbital curve in. Cooper draws a curved line on the whiteboard representing the course of the spacecraft. He tells the crew that if the TARS (robot) gets them through the curves, then they should be within range of Miller’s planet. Brand asks Cooper if he’s sure about this, and he tells her to tell him about it when they’re down there. He tells her to relax, and she asks him to just try not to make her mad. Cut to a shot of the spaceship in space. The Ranger then detaches from the Endurance. Cooper sits in the Ranger and checks with Case to make sure everything is ready. They joke about the fact that Case doesn’t speak much. The Ranger is released from the Endurance and hurtles toward the bright light of Gargantua. "
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_13.mp4",
        "Captions": "In this video, two guys in the metro are watching a man wearing a suit playing a game with a boy, similar to heads or tails. Whoever gets it right slaps the other hard. The man in the suit got it right, so he slapped the boy hard. When it was the boy’s turn, he also got it right, but instead of slapping the man, the man offered him money. The guys watching were observing carefully. The man played his turn again, but this time he failed. The boy then took his turn and succeeded again, so the man started clapping for him. This indicates that everyone is looking for what they need. The man in the suit appears to be an employee who needs to release tension to cope with job stress, while the boy simply wants money to buy what he needs."
    },
    {
        "video_category": "DC",
        "sub_category": "Context_window",
        "video_name": "CW_v_14.mp4",
        "Captions": "In this video, a group of people wearing green clothes are given objects with some symbols on them, a circle and a triangle. An old woman takes one of these tiny, rounded objects and starts playing with it, trying to lift one up and catch another on the table before catching the one she lifted. However, she keeps failing. The crowd surrounding her is very angry and scared, as if they will be punished if she doesn’t succeed. A man tells her, “You said that you played Gonggi (the name of the game) during the Korean War with bullets”. She tries again without answering him. This time, she does it correctly, and everyone becomes curious. She finally succeeds, and everyone shakes with ecstatic joy, as if she has just rescued them from inevitable death."
    },
    {
        "video_category": "DC",
        "sub_category": "High_activity_and_distractions",
        "video_name": "HAD_v_1.mp4",
        "Captions": "In this video, we see German soldiers with a lady who seems to be the owner of the pub or from the upper class. They are sitting in the pub, drinking and playing cards. All of a sudden, a German command sergeant enters the pub, and everybody stands up out of respect. The lady, with a cigarette in her hand, welcomes the guests and calls the waiter, whose name is Eric, in French: “Eric, mon chéri,” which means “Eric, my love”. She says, “These are the guests I was waiting for”, which gives the idea that this is happening in France while it was occupied by the Germans. The Nazi army music in the background confirms this. The waiter, in German, asks the guests what they want to drink. They all respond without giving him any attention, saying, “Whisky”. Then, the lady stands up and leaves to join the guests' table. Before leaving, the friends sitting with her at the first table ask her to reveal her card, which was Genghis Khan, the Mongolian emperor who conquered vast territories. She replies, “I would never have been able to guess”. When she sits at the guests' table, one of the command sergeants asks her, saying, “I thought the French outnumbered the Germans here.” She replies, “Yeah, usually. But the wife of that soldier over there just gave birth to their baby, and he was allowed to party with his friends here tonight”."
    },
    {
        "video_category": "DC",
        "sub_category": "High_activity_and_distractions",
        "video_name": "HAD_v_2.mp4",
        "Captions": "This scene begins in a dilapidated building with two men talking. Then, the video cuts to a man with a notecard stuck to his forehead in a dimly lit tavern. A woman with a hat and lit cigarette explains that the nationality of the author has nothing to do with the nationality of the character, giving the example that Hamlet is Danish, despite being written by William Shakespeare, who was English. The man with the notecard on his forehead cheers with his friends. He’s figured out that he is Winnetou, a fictional Apache chief created by the German author Karl May. The scene then shows a waitress named Mathilda collecting empty mugs and serving schnapps to the group."
    },
    {
        "video_category": "DC",
        "sub_category": "High_activity_and_distractions",
        "video_name": "HAD_v_3.mp4",
        "Captions": "This video shows a soldier sitting in a cafeteria with a girl who has a drink and a book in front of her on the table. A man standing at the door of the cafeteria calls out the soldier’s name, and he enters the cafeteria happily with a woman. He salutes the soldier, whom he calls a war hero, and asks for an autograph signing. The woman turns right and tells the girl in French, “You’re lucky to be with a war hero.” The soldier intervenes to correct her, saying, “No, she’s not my girlfriend”. The woman then asks him, “Can you write ‘with my love’ to Abit?” (her name). The soldier returns to sit with the girl, and she asks him in French, “You are a war hero?” with an expression of surprise and contempt on her face. She then asks, “What did you do?”. The man replies that he was a sniper alone on a dangerous hill, with  thousands of bullets, facing 300 enemy soldiers. She asks, “How many soldiers did you kill?” He answers, “68 on the first day, 150 on the second day, and 32 on the third day”. The girl is shocked, and on the fourth day, they all left the city. The soldier, speaking fluent French and fighting with the Germans, suggests that he may have been convinced by the German Nazi ideology and fought with them against France, his original country. This is what makes him, in the eyes of the girl, a traitor."
    },
    {
        "video_category": "DC",
        "sub_category": "High_activity_and_distractions",
        "video_name": "HAD_v_4.mp4",
        "Captions": "This scene opens with two uniformed Nazi officers and a woman in a brown hat and suit sitting at a table in a dimly lit tavern. A bartender stands behind the bar, which has barrels of liquor on display, and other Nazi officers and townspeople sit at other tables. One officer says that the other seems to be immune to his charms. As they talk, the woman takes long drags from her cigarette, occasionally looking away. Then, the video cuts to one of the officer’s hands pulling a handgun from beneath the table. The first officer says he is getting weary of 'these monkeyshines,' referring to the game that the other Nazi officers are playing. The second officer remarks that he’s had a gun pointed at him the entire time, then accuses the first officer of not being a true German. The video then cuts to the bartender reading a book with one hand while holding a shotgun at the bar in the other. As he speaks, the second officer pulls out his own pistol and points it at the first, who says, 'Now there are three of us.' He goes on to identify himself as Frederick Zoller and tells the first officer that they are all in 'a bit of a sticky situation.'"
    },
    {
        "video_category": "DC",
        "sub_category": "Partially_observed_objects",
        "video_name": "POO_v_1.mp4",
        "Captions": "The opening shot shows a woman typing on a portable stenotype machine while seated at a conference table. The focus then shifts to the opposite side of the table, revealing a group of men, all dressed in suits. Among them, Mark Zuckerberg is noticeably more casually dressed in a simple t-shirt. The twins, Cameron and Tyler Winklevoss, are also present. The scene is a courtroom deposition. Cameron and Tyler are being questioned about their last names and how they are spelled, and the typist is recording the proceedings. Mark Zuckerberg appears to be listening intently to the exchange, his facial expression suggesting a mix of boredom and discomfort. The framing of the shot, including the typist in the foreground and the courtroom setting, emphasizes the formal and legal nature of the situation. The contrast between Zuckerberg's casual attire and the formal suits of the others underscores his outsider status. It also hints at potential underlying tensions between him and the Winklevoss twins. The focus on names and spellings suggests the importance of formal identification and record-keeping in the legal proceedings. The final shot of the clip shows the men’s legs and feet. Mark Zuckerberg’s feet are notably shod in Adidas flip-flops. The twin brothers wear identical dress shoes, suggesting uniformity and the fact that they are seen as a single unit in the narrative."
    },
    {
        "video_category": "DC",
        "sub_category": "Partially_observed_objects",
        "video_name": "POO_v_2.mp4",
        "Captions": "The opening shot of the scene is a close-up of Joaquin Phoenix's face. He is looking at the camera. The background is slightly out of focus and seems to be a combination of a dark red curtain and an off-white wall. He begins speaking in English, and a line of Arabic appears beneath his face. This happens throughout the scene. As he speaks about his partner, his face softens, and he seems wistful. The scene then cuts to him sitting at a light-colored desk in what appears to be his home. A box of multicolored papers, a desk lamp, and a computer can be seen on the desk. Behind him is a multicolored couch. The background seems to be various colored sections of walls. At first, the man is throwing sheets of paper over his shoulder in a playful manner. Then he retrieves a letter, puts it on the desk, and prints a piece of paper out on his computer. The scene then cuts to him reading the letter at his desk. There are various items on the shelves behind him. He sighs, and then the scene shifts to focus on a woman at her desk in what looks like an office. Many small cubicle-style desk areas are visible. Her screen shows his handwritten letter. She reads his words aloud. The scene ends with the woman speaking to the man."
    },
    {
        "video_category": "DC",
        "sub_category": "Scene_transitions_and_changing_backgrounds",
        "video_name": "STCB_v_1.mp4",
        "Captions": "This is a short video about a magic trick done with a ring on someone's finger. The video shows two hands. One hand has all of its fingers curled into the palm except for the ring finger, which has a ring on it. The other hand touches the finger with the ring on it, and then the hand with the ring on it extends all of its fingers outwards, and the ring has disappeared. The video narrator explains that he’s slowed down the video to help viewers catch how the trick is performed. The narrator then reveals the secret. The hand with the ring curls its fingers into its palm except for the middle finger. At the same time, the thumb releases the ring finger. Next, the curled-up fingers move over and grasp the middle finger in almost the same way they grasped the ring finger. Simultaneously, the thumb grabs the ring finger, and it curls into the palm. From that point, it's easy to transfer the ring to a different location. The title of the video is “Trick.”"
    },
    {
        "video_category": "DC",
        "sub_category": "Scene_transitions_and_changing_backgrounds",
        "video_name": "STCB_v_2.mp4",
        "Captions": "The scene takes place on a darkened stage with a painted backdrop of Greek columns and pillars. Along the front of the stage, small candles are lit. A spotlight is on a male magician, who holds up a flower and speaks to an assistant wearing a yellow corset and skirt. After she accepts the flower from him and places it at her chest, he then raises his hat above his head, points at it, and then the scene cuts briefly to a view of the upper part of the theatre where a small puff of smoke appears, then cuts back to the stage. The magician bows as the woman beside him turns toward the audience. He walks toward the backdrop, picks up his hat, and asks the audience to watch closely. He tells his assistant to move through the first doorway and exits the stage from a door near the second doorway. The scene cuts to her turning around as he enters through the second doorway, and then cuts back to him approaching her to explain what he is doing. He touches his hat to his chest and exits the stage through the second doorway, telling the audience that the trick has no trickery. The assistant remains facing the door, and the scene cuts back to him re-entering the stage through the first doorway as she steps through the second doorway. He waves to the audience as she approaches him and holds his hand aloft as they bow, receiving applause from the audience."
    },
    {
        "video_category": "DC",
        "sub_category": "Scene_transitions_and_changing_backgrounds",
        "video_name": "STCB_v_3.mp4",
        "Captions": "The scene begins with an audience member, played by Christian Bale, watching a magic show. The magician, standing on the stage before a backdrop depicting people riding horses, says that in his travels, he’s seen the future. He claims that the world is on the brink of new and terrifying possibilities and what the audience is about to see is not magic, it's science. He invites the audience to come onstage to examine the apparatus. He holds up a Tesla coil that produces bolts of electricity. The apparatus is a metal sphere attached to a framework, with thick cables running down to two boxes on the stage. The scene cuts to the audience member watching intently as a woman steps onto the stage. The magician removes his suit jacket, revealing a white vest. Another assistant joins them. The two assistants remove some of the wires from the apparatus as the magician looks on. Suddenly, a bolt of electricity shoots through the apparatus. Another audience member in the balcony asks the magician to raise his hand if he is alright, and he does so. The scene cuts to the audience member, who is deeply engrossed in the show and seems to disapprove."
    },
    {
        "video_category": "DC",
        "sub_category": "Scene_transitions_and_changing_backgrounds",
        "video_name": "STCB_v_4.mp4",
        "Captions": "This video shows a magic act performed on Britain’s Got Talent. An elderly couple bows on stage. The woman walks offstage, and the man crouches, as if performing a kata. He then morphs into a lion. The woman walks back onstage, and the lion sits next to her. Then she morphs into a wolf and sits next to the lion. The video ends with some audience reactions to the magic."
    }
]