[
    {
        "video_category": "EC",
        "video_name": "EC_v_1.mp4",
        "Captions": "This video shows A man with a beard and glasses is shown sitting on a tan couch. He wears a light green, short-sleeved, collared shirt. A green stripe with the name, “Jeffrey LaPratt, PsyD”, is at the lower edge of the frame, partially overlapping the green bottom of his shirt. To the man’s right is a green plant with dark green, oval-shaped, leaves. The wall behind Jeffrey is off-white. The lighting in the room is dim, with shadows along the wall. Jeffrey explains that he will explain a mindfulness exercise that involves observing an everyday object, for example, a pen, pencil, or phone, and looking at it as if it is the first time the observer has ever seen it. Jeffrey refers to this as “beginner’s mind” and the desired effect is “wordless watching.”"
    },
    {
        "video_category": "EC",
        "video_name": "EC_v_2.mp4",
        "Captions": "The video opens with a toddler holding a soccer ball, facing away from the camera. The child is wearing a light pink zip-up sweatshirt with a hood, light tan pants, and white shoes. Her dark, curly hair is pulled into a small ponytail. A pink clip is in her hair.  She begins walking along a light gray concrete path, passing by a tall chain-link fence and a patch of dried, light brown grass and weeds. The soccer ball she’s holding is worn and scuffed and has some pink coloration on it. The camera pans to show a fenced-in playground on the right side of the walkway. In the center of the playground, there is light brown sand with several white and red climbing structures. Some older children play on these structures while several adults stand, watching them. The toddler continues to walk, looking over her shoulder at the children in the playground. The toddler reaches the end of the sidewalk. She stumbles, falls on her bottom, and pushes the soccer ball away from her a few feet. She stands and pushes the ball with her foot toward the camera. It rolls a few feet and then comes to a stop. The toddler walks up to the soccer ball, picks it up, walks over to the concrete walkway, and sits with the soccer ball in her lap. She faces toward the playground, watching the children on the play structure."
    },
    {
        "video_category": "EC",
        "video_name": "EC_v_3.mp4",
        "Captions": "This video clip shows a young girl playing with a doll in her home. The video pans in closer to the girl, showing her with her doll. She is wearing a dark navy-blue hoodie over a dark pair of printed pants.  She also has on a pair of white socks. She is wearing a couple of small, hoop earrings in her ears. She has a small amount of dark curly hair that is pulled back loosely with a clip on the top of her head. She is of a brown complexion. The doll she is carrying has dark reddish-brown curly hair, similar to her own. The doll wears an orange-white-and-pink, floral-printed romper, and seems to be made of some kind of plastic or vinyl. The little girl walks around, making noises, turning the doll in her hands as if she is holding her baby and talking to her. At times, she makes noises that suggest she is kissing the doll. As she walks, she seems to be singing and talking at the same time. At one point, she hugs the doll close to her chest, and appears to talk to the doll. The background of the video shows a glimpse of a room where a wooden daybed has a stack of colorful blankets and pillows on top. Other colorful pillows are stacked on the seat of a wooden framed couch in the background. A pair of green Crocs and a pair of white Crocs rest on the light, tiled floor of the room. A blue plastic ring is lying on the floor by the other couch. A set of wooden shelves is visible in the background, with various household objects resting on the shelves. The floor is tiled a pale tile, possibly ivory in color. The walls of the room seem to have pale rectangular tiles covering the lower part of the walls."
    },
    {
        "video_category": "EC",
        "video_name": "EC_v_4.mp4",
        "Captions": "This video shows a young toddler playing with some toys in her home. The camera pans in close to her to show what she’s playing with, and then zooms back out so we can see more of her. She is dressed in a cream and light pink-colored, long-sleeved, zip-up, track-style suit. Her cuffs at the bottom are pale pink and baby blue. She has on striped socks with a cream, tan, orange, and red stripe pattern. Her dark curly hair appears to be a bit messy, as if she’s been playing for a while. She appears to be of a brown complexion. The little girl appears to be playing with plastic toy dishes, one yellow and one red. She picks up the dishes and waves them around a bit, making various sounds. As she plays, she walks across the tiled floor of her play area. In the background of the video, we see a small light wooden daybed, stacked with a gray blanket and various patterned pillows.  A dark blue blanket also rests on the floor. More toys are scattered across the room. A pair of yellow Crocs rests on the floor near the little girl’s feet. A colorful ring toy lays in front of the daybed.  What seems to be a light-colored plastic toy, a high chair or stroller, also sits in the background. The camera person’s hand is seen as they offer a toy to the little girl. The video continues as she plays, making sounds. The camera angle is very close to her and shows the toys from her point of view."
    },
    {
        "video_category": "EC",
        "video_name": "EC_v_5.mp4",
        "Captions": "This video shows a toddler exploring a computer setup. The camera pans across a dark gray rug on a tiled floor covered with children’s toys. A pink scooter, a gray pillow, plastic dishes, and some markers and writing materials are scattered around the room. The camera focuses on the toddler sitting at a desk, which seems to be very large for her. The desktop is of a pale wood-like material. The child wears a pink long-sleeved shirt with a raised texture. Her dark, curly hair is a bit tousled. She is seated in a gray, ergonomic style office chair. On the desk are two computer screens, a laptop, a mouse, and a black keyboard. Behind the keyboard is a shield-shaped mouse pad with the logo 'BEL' on it. There is a pair of earbuds and another small, black item on the desk also. The laptop screen and the computer screen closest to the laptop are both showing a blank white screen. The third screen is turned on and appears to show photos. The camera zooms in on the toddler at the desk as she explores the computer. She picks up the mousepad and plays with it, waving it in front of her. Then, she puts it back down on the desktop and begins touching the keyboard. She presses down on various keys as the camera records her actions. She seems very interested in the setup. She is playing with and interacting with the equipment. The camera person asks her some questions, but it’s unclear what she says in response."
    },
    {
        "video_category": "EC",
        "video_name": "EC_v_6.mp4",
        "Captions": "This video shows a young girl playing with a soccer ball at a small soccer field. She is dressed in light pink pants and a pale pink and white top with a matching white, puffy vest. She has on white shoes and her dark hair is pulled back in a low ponytail. A small pink clip rests at the top of her head. The young girl runs up and down a cement walkway, stopping to grab and hold the ball near a small chain link fence. The background shows other kids playing on the field. The field appears to be turf.  Several adults and a person on a bicycle are visible. A man in dark clothing is visible in the background near a white snack cart with a cartoon character image on the side. The young girl is laughing and playing as she moves with the soccer ball.  She carries the ball in her hands, making sounds. She seems to be having fun. The sun is low in the sky, casting a hazy glow over the scene."
    },
    {
        "video_category": "EC",
        "video_name": "EC_v_7.mp4",
        "Captions": "This video shows the viewfinder of a video camera focused on a person with short blonde hair, wearing a rust-colored long-sleeved shirt. As the image magnifies, colored lines appear across the person’s face in the viewfinder. A black screen appears with the words “Focus Peaking” displayed in white lettering. The viewfinder shows a person walking forward toward the camera in an outdoor setting. The person’s image has a red-and-green overlay in the areas considered “in focus.” A man with a beard and long hair is now shown sitting at a light wood table. He wears a gray T-shirt. He talks about “focus peaking” and how some cameras have a special function. Behind him, there is a gray wall and a staircase-shaped white shelving unit. Green plants in light-colored pots and what appears to be camera equipment are on the shelves. A tall lamp with an exposed filament lightbulb stands on a table behind the man. The video camera’s viewfinder is again displayed, zoomed in on the person’s face. The background is blurred, and red lines appear along the person’s face. The man with the beard and long hair reappears, this time against a gray background. He warns that focus peaking is not always 100% accurate, especially in bright environments. The camera viewfinder image returns, showing a menu of camera controls for focus peaking. A finger navigates the menu, setting the “Focus Assist Level” to “Medium.”"
    },
    {
        "video_category": "EC",
        "video_name": "EC_v_8.mp4",
        "Captions": "The video begins with a cartoon animation, set against a dark background, displaying the title sequence for The Savage Filmmaker. As this intro animation plays, a QR code is shown in the lower-left corner of the screen. The introductory animation consists of claws, followed by a cartoon of a man with light-brown hair, a beard, and blue eyes. He’s wearing a baseball cap backward and has metal claws extending from between his knuckles. He then transforms into a different cartoon man, also with light brown hair and a beard, wearing sunglasses and a black T-shirt, holding a video camera and pointing. The name “THE SAVAGE FILMMAKER” appears in white lettering, outlined in black, underneath this final cartoon figure. The scene cuts to a bearded man with long, dark hair, sitting at a light wooden table wearing a gray T-shirt with two animated cartoon characters on it. Behind him is a gray wall and white shelving, shaped like a zig-zagging staircase. On the shelves are green plants and what appear to be camera parts. A tall, thin lamp with a bare Edison light bulb sits behind him on a small table. The scene cuts to a Canon camera displaying a magnified image of a woman's eye on its digital display. The camera is positioned on a tripod, and the background shows an out-of-focus person, wearing a dark orange shirt, standing in an outdoor setting with green foliage. The bearded man returns to the table, and he discusses the use of the magnification tool for achieving focus. Finally, the video returns to the initial camera shot of the woman, wearing a rust-colored shirt, from the opening moments of the video. The camera view magnifies the woman’s face, and red and purple lines appear superimposed across her image."
    },
    {
        "video_category": "EC",
        "video_name": "EC_v_9.mp4",
        "Captions": "The video begins with a bearded man with shoulder-length dark hair seated at a wooden table. He wears a short-sleeved heather gray shirt with two cartoon characters on it. Behind him is a gray wall with a stair-stepped white shelving unit. On the shelves are plants in light-colored pots and cylindrical objects that look like they might be camera lenses or lights. A tall metal lamp with an exposed filament sits on a small round table next to the man. There is a light fixture behind the shelving, providing indirect illumination. The man speaks directly to the viewer about manually focusing a camera, especially when using a manual lens, a cinema lens, or a vintage lens, or if your camera does not have autofocus. The video then shows a camera, attached to a tripod, with a small external monitor attached to its side. The video cuts to a shot of someone manually focusing a camera at night. The ground is tiled gray pavement, and there are some blurred white lights in the background. Next, the video shows a person using a camera on the shore of a lake or ocean at sunset. The water is a light brownish-gray color and extends to the horizon. The scene returns to the bearded man at his table. He notes that, when using cinema cameras, manual focus is a valuable skill to learn."
    },
    {
        "video_category": "EC",
        "video_name": "EC_v_10.mp4",
        "Captions": "This video shows a toddler interacting with a duck. The child is wearing a yellow jacket with animal print and a black hat.  A plate of food sits on the floor near them. The toddler and duck appear to be on a rug or mat with a black and white houndstooth print. The toddler offers some food to the duck. The duck eats some of the food from the plate, then appears to try to take more from the plate directly. The toddler stops the duck and seems to show the duck that it must eat only what is offered to it. The toddler makes some gentle motions with his hands as he gives the duck food from his hand.  The duck seems to respond. The toddler then puts his hands together and makes some more sounds, and the duck moves to face him."
    },
    {
        "video_category": "EC",
        "video_name": "EC_v_11.mp4",
        "Captions": "This video shows a man in a suit approaching a homeless man in a park to offer him a gift. The homeless man is sleeping on a park bench with a folded newspaper beneath his head. He appears to be wearing a dirty, olive green jacket and pants. He has dirt smudged on his face. A backpack and a cardboard box are sitting on the ground near the bench. Other homeless people are also seen sleeping in the park.  Green shrubbery and several trees are visible in the park, as well as a path or walkway made of some kind of hard surface. The man in the suit, who appears clean and tidy, wakes the homeless man and asks him if he’d like a gift. The man in the suit is wearing a dark navy suit, a white shirt, and a black tie. He appears to have a purple lanyard around his neck.  The homeless man smiles as he wakes up and sits up on the bench. The camera focuses on the man in the suit as he offers two choices to the homeless man: a packaged roll or bun, and a lottery ticket.  The homeless man smiles again as he picks up the lottery ticket. The man in the suit then offers him a coin to scratch off the lottery ticket. The homeless man uses the coin to scratch off the ticket and seems surprised and delighted to have won the lottery. The man in the suit picks up a large brown paper bag that he has brought to the park. He removes a small box or parcel from the bag and offers it to the homeless man. The video ends as the homeless man accepts the package."
    }
]