[
    {
        "video_category": "MC",
        "sub_category": "Moderate_interactions",
        "video_name": "MI_v_1.mp4",
        "Captions": "The scene begins with Mia and Sebastian walking toward the camera, side by side, across the overlook’s paved area. Once they reach the edge of the overlook, they stop and gaze out at the twinkling city lights below. They turn to face each other and begin tap-dancing. They dance near a bench, and then run down the paved road toward a lone streetlamp. They continue dancing beneath the streetlamp, then dance their way into a clearing near a tree where they twirl, kick their legs high, and incorporate other playful movements into their routine. As they dance, the sun sinks lower and lower in the sky. The dance ends with a kiss, and then the couple dances again, now running across the clearing toward the city view. They dance their way back to the bench where they started, their movements becoming slower and more romantic, mirroring the increasingly dim light. The music ends and Mia gets a phone call. It’s Greg, her boyfriend. Mia tells Greg she will be there soon, then hangs up. Sebastian picks up his suit jacket from the bench. The couple gazes out at the city in silence, as if contemplating what just transpired. They exchange one final glance before walking off in opposite directions."
    },
    {
        "video_category": "MC",
        "sub_category": "Moderate_interactions",
        "video_name": "MI_v_2.mp4",
        "Captions": "The scene opens with Mia, wearing a yellow dress, and Sebastian, in a white shirt and tie, standing with their backs to the camera and looking out at the city lights below. They turn and look at each other, then start tap-dancing around a bench. They dance along the street under a streetlamp, and then into a clearing near a tree. They dance side-by-side, alternating their tap movements, and continue dancing playfully around each other, including some jump kicks and twirls. The dance ends with a kiss, after which they separate and resume dancing some more, now running across the clearing as the sun has completely set."
    },
    {
        "video_category": "MC",
        "sub_category": "Moderate_interactions",
        "video_name": "MI_v_3.mp4",
        "Captions": "This scene from La La Land shows Mia and Sebastian's final dance and farewell on a hilltop overlooking Los Angeles, just after sunset. They begin by dancing playfully near a bench, their movements echoing classic Hollywood musicals. They then move down the road, their steps becoming more energetic and joyful as they dance under a streetlight. Their dance continues in a clearing near a tree, incorporating twirls, jumps, and playful interactions. They share a kiss as the sunset intensifies the romantic atmosphere. After the kiss, their dance becomes more fluid and expansive. They run across the clearing, their arms outstretched, embracing the magic of the moment. They return to the bench as the sky darkens, their dance becoming more subdued and introspective. The music fades, and Mia answers a phone call, interrupting the spell. It's Greg, her boyfriend. She tells him she'll be there soon and hangs up. As Mia gathers her belongings, Sebastian retrieves his jacket, the finality of their parting hanging in the air. They exchange a final look before walking in opposite directions, marking the end of their shared dream and the beginning of their separate journeys."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_1.mp4",
        "Captions": "In this tense scene from Disney's The Lion King II: Simba's Pride, Mufasa confronts his brother, Scar, about his absence from Simba's presentation. Scar feigns ignorance and then mocks the ceremony, referring to Simba as a 'hairball.' Mufasa asserts Simba's position as his son and future king, prompting a sarcastic remark from Scar. The tension escalates as Mufasa warns Scar not to turn his back on him, leading to a veiled threat from Scar in return. The confrontation continues with Scar acknowledging Mufasa's superior strength while Zazu, the hornbill, goads Scar to challenge Mufasa. Scar declines, feigning weakness, setting the stage for further conflict."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_2.mp4",
        "Captions": "The scene starts with a lion and lioness lying together next to their newborn cub. The mother lioness licks her cub gently and wraps a paw around it as it sleeps. Then, a mandrill with a red, blue, and white face climbs over the branch and rubs the fur and feet of the cub. The mandrill presents a round, dark red melon fruit and splits it in half, placing one half in front of the cub. The mandrill smears some of the red juice on the cub's forehead and then scatters sand over it. The parents watch the mandrill as it carefully picks up the cub and presents it up to the sky, where the cub looks down at the gathered herd of gazelle, zebra, giraffes, and rhinos. The mandrill brings the cub back down and looks at its parents affectionately. The mandrill lifts the cub again towards the sky and holds it so the entire herd can see the future ruler of the pride. In the background, a group of smaller monkeys cheer and jump in excitement."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_3.mp4",
        "Captions": "This clip shows the presentation of Simba to the animal kingdom in The Lion King. Rafiki holds Simba aloft from Pride Rock while other animals in the kingdom bow before their future king. A chorus sings, “Circle of Life.” At the beginning of the clip, we see Rafiki presenting Simba to the baboons who gather at the base of Pride Rock. They excitedly wave their arms in the air as they acknowledge their future king. The next few seconds show zebras running through the land as Rafiki continues up to the top of Pride Rock to present Simba to all the animals. The zebras look up towards the rock, as if bowing to the young lion. We see Rafiki gently holding Simba, who has his eyes closed. Rafiki holds Simba in his hands, with the young cub’s paws resting on the baboon’s wrists. Rafiki raises the cub up in the air. We then see Rafiki lifting Simba high in the air above Pride Rock. Mufasa sits nearby, watching. The scene expands as we see other animals, such as zebras, elephants, and giraffes, gathering in the plains to look up at Pride Rock, bowing their heads before the young cub."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_4.mp4",
        "Captions": "This clip from The Lion King shows Scar tormenting Zazu before Mufasa arrives to rescue him. At the start of the clip, a small, gray mouse is seen inside Scar’s cave. The mouse looks around nervously, as if looking for an exit.  Scar’s paw pins the mouse to the ground as he picks it up by its tail.  He speaks to the mouse, lamenting his fate as being second in line for the throne. He then pretends he’s about to eat the mouse, dangling it in front of his face. Zazu enters the cave and scolds Scar for missing Simba's presentation ceremony, warning him that Mufasa is on his way and furious. Scar plays coy with Zazu, grabbing the hornbill by the beak and swallowing him whole. Scar then spits Zazu back out. Mufasa enters the cave from above, demanding to know why Scar is bullying Zazu."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_5.mp4",
        "Captions": "This clip from the film Harry Potter and the Sorcerer’s Stone shows a Quidditch match between Gryffindor and Slytherin. Ron Weasley crashes into one of the goal posts, and Harry seems to get hit by the Quaffle. The clip opens with Ron sitting on a broomstick at one end of the Quidditch pitch. Behind him, one can see forested mountains. Three players in green Slytherin robes come barreling toward him. The Quaffle, the large, black ball used for scoring goals, also comes hurtling through the air toward Ron. Ron grimaces, and the Slytherin players knock him off his broomstick. The scene changes to show Harry on his broomstick. The camera zooms in on his face as he shouts in surprise. The view zooms back to show the scoreboard, labeled 'Slytherin' with the score of 10 for Slytherin and zero for Gryffindor. A large ringed goal post is seen against the forested hillside. A Slytherin player on a broomstick shouts 'Take that side!' and flies through the goal post with the Quaffle. The Slytherin students cheer from their stand, wearing green robes, scarves, and hats. A Slytherin player then knocks the Quaffle toward Harry. The Quaffle hits Harry in the head, and he falls toward the ground. The clip ends as the Gryffindor students shout in concern while the Slytherin students laugh and cheer."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_6.mp4",
        "Captions": "This scene from Harry Potter and the Sorcerer's Stone shows Harry Potter’s first Quidditch game. The scene opens with Harry, Hermione, and Ron nervously waiting. Then the Gryffindor Quidditch team walks in formation carrying their broomsticks, led by Oliver Wood, the team captain. Harry and Oliver have a short, encouraging conversation. Oliver tells Harry that he was nervous before his first game, but can’t remember what happened because a Bludger hit him in the head two minutes into the game, and he woke up in the hospital a week later. Next, the Quidditch teams fly onto the field as Lee Jordan announces the game and the crowd cheers. Madam Hooch, the referee, steps out onto the field to begin the game. Madam Hooch tells the teams she wants a nice, clean game, then throws the Quaffle into the air to start the game. The scene ends with a shot of the chest containing the Bludgers, Quaffle, and Golden Snitch."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_7.mp4",
        "Captions": "This scene shows the first Quidditch match of the season between Gryffindor and Slytherin. The clip begins with Harry watching the game with a smile. Ron, sitting next to him, is gaping in surprise at the play. The action moves to the Quidditch field where the seven members of the Gryffindor team march in single file with brooms over their shoulders. They enter through a dark, wood-framed opening onto the brightly lit Quidditch pitch. Harry and Oliver Wood lead the Gryffindor players. They pause as Oliver reminds Harry to remember the golden snitch. The scene shifts to the commentators’ box, where Lee Jordan calls out to the students to welcome them to Hogwarts’ first Quidditch match of the season: Gryffindor versus Slytherin. The students in the stands cheer. Madam Hooch announces the rules of the game. The Quaffle, Bludgers, and Golden Snitch are released into play. The Slytherin team immediately scores a goal. After more play, Angelina Johnson scores a goal for Gryffindor. The Slytherin students laugh as Ron Weasley crashes into one of the goal posts."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_8.mp4",
        "Captions": "The video opens with a shot of students flying on broomsticks. Then a decorated trunk is opened on the grass of a Quidditch pitch.  The Quaffle, two Bludgers, and a Golden Snitch are inside. As the referee explains the rules, the Snitch flies out. The players take their places in the air. The referee releases the Quaffle, and the game begins.  A student throws the Quaffle through a goal, scoring 10 points. Then, we see a player flying toward the goals with the Quaffle. Another player flies beside him, and they have some interaction where a foot extends. Next, we see a player throw the Quaffle through a goal.  The other players are trying to block him, but the ball goes through the goal. In the stands, we see some spectators. Then, we see the players flying around the goals, and one player kicks another in the back. He flies into a goal post. Next, a player smiles through a goal hoop. The video ends with players flying through the goal posts."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_9.mp4",
        "Captions": "The clip begins with a Quidditch player being knocked off his broomstick after colliding with a Bludger thrown by a Slytherin Beater. The player in red lands near a goalpost and slides to the ground. The game continues as the Quaffle is tossed between players of each team. A green-clad Slytherin player throws the Quaffle through a hoop, scoring 10 points for Slytherin. The scoreboard changes to show that Gryffindor has 20 points, and Slytherin has 10 points. We see fans of Gryffindor cheering in the stands and a Slytherin fan looking somber. Then, two Slytherin Beaters swing their bats and a close-up shows one of them looking excited. The other Slytherin Beater throws a Bludger at a red-clad Gryffindor player. He appears to block it but then falls to the ground as his broom tumbles. Harry Potter, the Gryffindor Seeker, looks disgusted and we next see one of the Slytherin Beaters smile."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_10.mp4",
        "Captions": "The clip takes place in a bathroom, where a large troll lies unconscious on the floor amidst debris.  Ron Weasley stands in the background, looking shocked. Hermione Granger emerges from the stalls and asks if it is dead. Harry Potter looks closer and says he doesn’t think so, “Just knocked out.” Hermione looks relieved. Minerva McGonagall, Severus Snape, and Quirinus Quirrell enter the bathroom.  McGonagall asks Hermione to explain herself. Hermione says that she went looking for the troll because she’d read about them and thought she could handle it. “But I was wrong,” she says. She admits that if Harry and Ron hadn’t found her, she would likely be dead.  Harry nods. McGonagall says it was a foolish thing to do and that she would have expected more rational behavior from Hermione. Five points will be taken from Gryffindor for her lack of judgment, she says. McGonagall tells Harry and Ron that she hopes they realize how fortunate they are, as few first-year students survive encounters with trolls.  Five points will be awarded to each of them for their bravery and quick thinking. Both boys look pleased."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_11.mp4",
        "Captions": "This scene from Harry Potter and the Sorcerer's Stone shows the trio’s encounter with a troll. It starts with Hermione running from a troll into a girls’ bathroom. After she enters the bathroom, she cries, wipes a tear, and runs into a stall. A troll enters the bathroom. Hermione screams and then cowers in the stall as the troll walks toward her and smashes the stall door with its club. Harry and Ron enter the bathroom. Harry distracts the troll by yelling, and the troll chases after him, smashing more stalls. Ron uses the levitation charm, Wingardium Leviosa, to lift the troll’s club. The club hits the troll on the head and it falls unconscious. The scene ends with the trio catching their breath and Hermione gratefully telling Ron and Harry that she’s okay."
    },
    {
        "video_category": "MC",
        "sub_category": "Multiple_objects_or_subjects",
        "video_name": "MOS_v_12.mp4",
        "Captions": "Hermione is hiding in a stall in a girls' bathroom at Hogwarts School of Witchcraft and Wizardry when a troll enters. She screams and cowers further back in the stall as the troll begins to smash the stall apart. Harry and Ron arrive on the scene. Harry yells at the troll to distract it from Hermione, and the troll begins to chase him. The troll swings its club at Harry, missing him narrowly, and gets its club stuck in a pipe. Hermione tells Ron how to cast the levitation spell, and Ron lifts the club into the air. The club falls and knocks the troll unconscious. Harry lands on the floor near Hermione, and she thanks Harry and Ron for saving her."
    }
]